#include "timer.h"
#include "ioCC2541.h"
#include "bledoorlock.h"
/*定时器4初始化*/
/*************************************************************************
* 函数名 InitT4
* 参数： count  设置倒计数的初值
* 输出比较模式：
************************************************************************/
void InitT4(uint8 data)
{ 
  IEN1 |= 0x10;             // 开总中断和T4中断
  T4CTL |= 0xEE;        // 128分频, 未开启，未清除， 倒计数模式  128/32000000 * N = 0.01S N = 2500 ， 2500/250 = 10次
//  T4CTL |= 0x04;        // 清除定时器
  T4CTL |= 0x10;        // 启动
  T4CCTL0 = 0x44;
  T4CC0 = data;
  EA = 1;
} 

void T4_Start(void)
{
  T4CTL |= 0x10;        //再次启动定时器4
}

void T4_Stop(void)
{
  T4CTL &= ~0x10;        //关闭定时器4
}

void T4_Clear(void)
{
  T4CTL |= 0x04;
}

 /******************************************************************************
 2 *函 数 名：Timer4_ISR
 3 *功    能：定时器4中断服务程序
 4 *入口参数：无
 5 *出口参数：无
 6 ******************************************************************************/

uint16 count = 0;

#pragma vector = T4_VECTOR 
__interrupt void Timer4_ISR(void) 
{ 
  
  IRCON &= ~0x10;       //定时器4中断标志位清0
  TIMIF &= ~0x08;       //定时器4溢出中断标志位清0
  T4CTL |= 0x10;        //再次启动定时器4
  
  // 10次为10ms, 
  if(count++ > 2000)     // 2S 灯闪烁一次
  {
   count = 0;
//   LED2 = ~LED2;
  }
}




